[
    {
        "name": "Hispa beetles",
        "desc": "   Hispa Beetles  Dicladispa armigera is a species of leaf beetle from Southeast Asia, often known by its common name: the rice 'hispa'. These beetles are a well known invasive pest, and are responsible for significant crop damage across many countries. The male to female ratio is between 1:1.26 and 1:1.46",
        "image": "hispa_beetles.jpg"
    },
    {
        "name": "Rice leaf beetle",
        "desc": "   Rice Leaf Beetle  The rice beetle, Dyscinetus morator (Fabricius) (Figure 1), is a common beetle in the eastern half of the United States, and it is one of the most ubiquitous species taken in blacklight traps during much of the year. It appears to be only a minor pest, but it is often brought to the homeowner's attention because of the large quantities found around lights. ",
        "image": "rice_leaf_beetle.jpg"
    },
    {
        "name": "Armyworms",
        "desc": "   Armyworms  are caterpillar pests of grass pastures and cereal crops. They are the only caterpillars that growers are likely to encounter in cereal crops, although occasionally native budworm will also attack grain when underlying weed hosts dry out. Armyworms mostly feed on leaves, but under certain circumstances will feed on the seed stem, resulting in head loss. The change in feeding habit is caused by depletion of green leaf material or crowding. In the unusual event of extreme food depletion and crowding, they will 'march' out of crops and pastures in search of food, which gives them the name 'armyworm'.",
        "image": "armyworms.jpg"
    },
    {
        "name": "Cutworms",
        "desc": "   Cutworms  are moth larvae that hide under litter or soil during the day, coming out in the dark to feed on plants. A larva typically attacks the first part of the plant it encounters, namely the stem, often of a seedling, and consequently cuts it down; hence the name cutworm. Cutworms are not worms, biologically speaking, butcaterpillars. ",
        "image": "cutworms.jpg"
    },
    {
        "name": "Leaffolders",
        "desc": "   Leaffolders  Leaffolder caterpillars fold a rice leaf around themselves and attach the leaf margins together with silk strands. \n\nThey feed inside the folded leaf creating longitudinal white and transparent streaks on the blade. Rice leaffolders occur in all rice environments and are more abundant during the rainy seasons. They are commonly found in shady areas and areas where rice is heavily fertilized. In tropical rice areas, they are active year-round, whereas in temperate countries they are active from May to October. The adults are nocturnal and during the day, they stay under shade to escape predation. Moths fly short distances when disturbed.",
        "image": "leaffolders.jpg"
    },
    {
        "name": "Thrips",
        "desc": "    Thrips  (order Thysanoptera) are minute (most are 1 mm long or less), slenderinsects with fringed wings and unique asymmetrical mouthparts. Different thrips species feed mostly on plants by puncturing and sucking up the contents, although a few are predators. Approximately 6,000 species have been described. They fly only weakly and their feathery wings are unsuitable for conventional flight; instead, thrips exploit an unusual mechanism, clap and fling, to create lift using an unsteady circulation pattern with transient vortices near the wings. \n\nMany thrips species are pests of commercially important crops. A few species serve as vectors for over 20 viruses that cause plant disease, especially the Tospoviruses. Some species of thrips are beneficial as pollinators or as predators of other insects or mites. In the right conditions, such as in greenhouses, many species can exponentially increase in population size and form large swarms because of a lack of natural predators coupled with their ability to reproduce asexually, making them an irritation to humans. In addition, Thrips are also known to invade houses and infest objects such as furniture, bedding and computer monitors - in the latter case by forcing their way in between the LCD and its glass covering.[2] Their identification to species by standard morphological characters is often challenging. ",
        "image": "thrips.jpg"
    },
    {
        "name": "Greenhorned caterpillars",
        "desc": "    Greenhorned caterpillars  Manduca quinquemaculata, the five-spotted hawkmoth, is a brown and grayhawk moth of the family Sphingidae. The caterpillar, often referred to as the tomato hornworm, can be a major pest in gardens; they get their name from a dark projection on their posterior end and their use of tomatoes as host plants. Tomato hornworms are closely related to (and sometimes confused with) the tobacco hornworm Manduca sexta. This confusion arises because caterpillars of both species have similar morphologies and feed on the foliage of various plants from the family Solanaceae, so either species can be found on tobacco or tomato leaves. Because of this, the plant on which the caterpillar is found does not indicate its species. ",
        "image": "green_horned_caterpillars.jpg"
    },
    {
        "name": "Skipper butterflies",
        "desc": "    Skipper butterflies  are a family, the Hesperiidae, of the Lepidoptera (moths and butterflies). Being diurnal, they are generally called butterflies. They were previously placed in a separate superfamily, Hesperioidea; however, the most recent taxonomy places the family in the superfamily Papilionoidea. They are named for their quick, darting flight habits. Most have their antenna tips modified into narrow, hook-like projections. More than 3500 species of skippers are recognized, and they occur worldwide, but with the greatest diversity in the Neotropical regions of Central and South America",
        "image": "skipper_butterflies.jpg"
    },
    {
        "name": "Brown semilooper",
        "desc": "    Brown semilooper  Mocis undata, the brown-striped semilooper, is a moth of the family Erebidae. The species was first described by Johan Christian Fabricius in 1775. It is found in the Afrotropical and Oriental regions, including India and Sri Lanka. \n\nMale with mid and hind tibia clothed with long hair. Body pale red-brown. Abdomen pale fuscous, the anal tuft ochreous. Forewing with a short sub-basal red-brown line. An oblique antemedial pale of ochreous line present, with diffused red-brown band on its outer edge. A sinuous medial line angled on median nervure. Reniform large and indistinct. A red-brown diffused postmedial band, on which is a dark line slightly curved outwards beyond the cell, and at vein 2, it is very irregularly curved inwards to lower angle of cell, then descending to inner margin. An indistinct pale waved sub-marginal line present with a black specks series on it. There is a dark waved marginal line. Hindwings ochreous fuscous, with narrow fuscous medial band and diffused sub-marginal band. Legs rufous\n\nLarva purplish brown speckled with black. The lateral area yellowish with red lines. A sub-lateral row of small black dots present. Head brownish with red lateral streak. Pupa efflorescent. The larvae feed on Cytisus, Desmodium, Wisteria, Arachis,Butea, Cajanus, Calopogonium, Crotalaria, Derris, Glycine, Indigofera, Mucuna,Phaseolus, Pueraria, Rhynchosia, Tephrosia, Vigna, Shorea, Hevea, Gossypium,Nephelium and Solanum species. ",
        "image": "brown_semilooper.jpg"
    },
    {
        "name": "Hairy caterpillars",
        "desc": "    Hairy caterpillars  Metanastria hyrtaca, called the hairy caterpillar as a larva, is a moth of the familyLasiocampidae first described by Pieter Cramer in 1782.[1] It is found in Sri Lanka. \n\nThe adult has a grayish head and thorax and a whitish abdomen. Forewings are brownish with a characteristic reddish-brown spot ringed with white. Hindwings are whitish. Larva yellowish brown with black spots and long lateral tufts of hairs. A reddish band is found in the neck region.The caterpillar is a serious pest of many economically important crops such ascashew, badam, moringa, sapota, jamun, guava, Vachellia nilotica, Shorea robusta,Schima wallichii, Nyctanthes arbor-tristis, Mimusops elengi and Madhuca longifolia ",
        "image": "hairy_caterpillar.jpg"
    },
    {
        "name": "Grasshoppers",
        "desc": "    Grasshoppers  are a group of insects belonging to the suborder Caelifera. They are among what is probably the most ancient living group of chewing herbivorous insects, dating back to the early Triassic around 250 million years ago. Grasshoppers are typically ground-dwelling insects with powerful hind legs which allow them to escape from threats by leaping vigorously. As hemimetabolous insects, they do not undergo complete metamorphosis; they hatch from an egg into a nymphor 'hopper' which undergoes five moults, becoming more similar to the adult insect at each developmental stage. At high population densities and under certain environmental conditions, some grasshopper species can change color and behavior and form swarms. Under these circumstances, they are known as locusts. \n\nGrasshoppers are plant-eaters, with a few species at times becoming serious pestsof cereals, vegetables and pasture, especially when they swarm in their millions as locusts and destroy crops over wide areas. They protect themselves from predatorsby camouflage; when detected, many species attempt to startle the predator with a brilliantly-coloured wing-flash while jumping and (if adult) launching themselves into the air, usually flying for only a short distance. Other species such as the rainbow grasshopper have warning coloration which deters predators. Grasshoppers are affected by parasites and various diseases, and many predatory creatures feed on both nymphs and adults. The eggs are subject to attack by parasitoids and predators. \nn\nrasshoppers have had a long relationship with humans. Swarms of locusts can have devastating effects and cause famine, and even in smaller numbers, the insects can be serious pests. They are used as food in countries such as Mexico and Indonesia. They feature in art, symbolism and literature. ",
        "image": "grasshoppers.jpg"
    },
    {
        "name": "Locusts",
        "desc": "   Locusts  are a collection of certain species of short-horned grasshoppers in the family Acrididae that have a swarming phase. These insects are usually solitary, but under certain circumstances they become more abundant and change their behaviour and habits, becoming gregarious. No taxonomic distinction is made between locust and grasshopper species; the basis for the definition is whether a species forms swarms under intermittently suitable conditions. These grasshoppers are innocuous, their numbers are low, and they do not pose a major economic threat to agriculture. However, under suitable conditions of drought followed by rapid vegetation growth, serotonin in their brains triggers a dramatic set of changes: they start to breed abundantly, becoming gregarious and nomadic (loosely described asmigratory) when their populations become dense enough. They form bands of wingless nymphs which later become swarms of winged adults. Both the bands and the swarms move around and rapidly strip fields and cause damage to crops. The adults are powerful fliers; they can travel great distances, consuming most of the green vegetation wherever the swarm settles.\n\nLocusts have formed plagues since prehistory. The ancient Egyptians carved them on their tombs and the insects are mentioned in the Iliad, the Bible and the Quran. Swarms have devastated crops and been a contributory cause of famines and human migrations. More recently, changes in agricultural practices and better surveillance of locations where swarms tend to originate, have meant that control measures can be used at an early stage. The traditional means of control are based on the use of insecticides from the ground or the air, but other methods usingbiological control are proving effective.\n\nSwarming behaviour decreased in the 20th century, but despite modern surveillance and control methods, the potential for swarms to form is still present, and when suitable climatic conditions occur and vigilance lapses, plagues can still occur. Locusts are large insects and convenient for use in research and the study of zoology in the classroom. They are also edible insects; they have been eaten throughout history and are considered a delicacy in many countries. The word 'locust' is derived from the Vulgar Latin locusta, meaning grasshopper. ",
        "image": "locusts.jpg"
    },
    {
        "name": "Crickets",
        "desc": "    Crickets  (also known as 'true crickets'), of the family Gryllidae, are insectsrelated to bush crickets, and, more distantly, to grasshoppers. The Gryllidae have mainly cylindrical bodies, round heads, and long antennae. Behind the head is a smooth, robust pronotum. The abdomen ends in a pair of long cerci; females have a long, cylindrical ovipositor. The hind legs have enlarged femora, providing power for jumping. The front wings are adapted as tough, leathery elytra, and some crickets chirp by rubbing parts of these together. The hind wings are membranous and folded when not in use for flight; many species, however, are flightless. The largest members of the family are the bull crickets, Brachytrupes, which are up to 5 cm (2 in) long. \n\nMore than 900 species of crickets are described; the Gryllidae are distributed all around the world except at latitudes 55° or higher, with the greatest diversity being in the tropics. They occur in varied habitats from grassland, bushes, and forests to marshes, beaches, and caves. Crickets are mainly nocturnal, and are best known for the loud, persistent, chirping song of males trying to attract females, although some species are mute. The singing species have good hearing, via the tympana on the tibiae of the front legs. \n\nCrickets often appear as characters in literature. The Talking Cricket features inCarlo Collodi's 1883 children's book, The Adventures of Pinocchio, and in films based on the book. The eponymous insect is central to Charles Dickens's 1845 The Cricket on the Hearth, as is the chirping insect in George Selden's 1960 The Cricket in Times Square. Crickets are celebrated in poems by William Wordsworth, John Keats, and Du Fu. They are kept as pets in countries from China to Europe, sometimes for cricket fighting. Crickets are efficient at converting their food into body mass, making them a candidate for food production. They are used as human food in Southeast Asia, where they are sold deep-fried in markets as snacks. They are also used to feed carnivorous pets and zoo animals. In Brazilian folklore, crickets feature as omens of various events. ",
        "image": "crickets.jpg"
    },
    {
        "name": "Katydids",
        "desc": "    Katydids  Insects in the family Tettigoniidae are commonly called katydids (in Australia, South Africa, Canada, and the United States),[1] or bush crickets.[2] They have previously been known as long-horned grasshoppers.[3] More than 6,400 speciesare known. Part of the suborder Ensifera, the Tettigoniidae are the only extant (living) family in the superfamily Tettigonioidea. \n\nThey are primarily nocturnal in habit with strident mating calls. Many katydids exhibitmimicry and camouflage, commonly with shapes and colors similar to leaves. ",
        "image": "katydids.jpg"
    }
]