[
    {
        "name": "Green leafhoppers",
        "desc": "    Green leafhoppers  Green leafhoppers are common in rainfed and irrigated wetland environments. They are not prevalent in upland rice. Both the nymphs and adults feed on the dorsal surface of the leaf blades rather than the ventral surface. They prefer to feed on the lateral leaves rather than the leaf sheaths and the middle leaves. ",
        "image": "green_leafhoppers.jpg"
    },
    {
        "name": "Zigzag leafhopper",
        "desc": "    What it does Feeding damage of zigzag leaf hopper causes the leaf tips to dry up, and whole leaves to become orange and curled. Why and where it occurs Grassy weeds and volunteer rice in fallow fields attract the zigzag leafhopper and the viruses it transmit to exist between rice crops. The rice zigzag leafhopper is found in all rice environments. It is abundant during the early rainy season in the early growth stages of the rice plant. It rarely occurs in large numbers. The adults usually stay in the upper parts of the rice plants. A high population density of the zigzag leafhopper occurs in seedbeds and weeds between planting seasons. ",
        "image": "zigzag_leafhopper.jpg"
    },
    {
        "name": "White leafhopper",
        "desc": "A leafhopper is the common name for any species from the family Cicadellidae. These minute insects, colloquially known as hoppers, are plant feeders that suck plant sap from grass, shrubs, or trees. Their hind legs are modified for jumping, and are covered with hairs that facilitate the spreading of a secretion over their bodies that acts as a water repellent and carrier of pheromones. They undergo a partial metamorphosis, and have various host associations, varying from very generalized to very specific. Some species have a cosmopolitan distribution, or occur throughout the temperate and tropical regions. Some are pests or vectors of plant viruses and phytoplasmas. The family is distributed all over the world, and constitutes the second-largest hemipteran family, with at least 20,000 described species. ",
        "image": "white_leafhopper.jpg"
    },
    {
        "name": "Orange leafhopper",
        "desc": "Orange leafhopper  is a meadow and woodland-dwelling species of brightly colored leafhopper native to North and Central America, from Canada south to Panama. Common names include candy-striped leafhopper, red-banded leafhopper, scarlet-and-green leafhopper and red-and-blue leafhopper.  \n\nOrange leafhopper adults measure 6.7–8.4 mm in length and have vivid blue (or green) and red (or orange-red) stripes on their wings and the top of their thorax combined with bright yellow coloration on their head, legs, abdomen, and elsewhere.  ",
        "image": "orange_leafhopper.jpg"
    },
    {
        "name": "Maize orange leafhopper",
        "desc": "The brown planthopper (BPH), Nilaparvata lugens (Stål) (Hemiptera: Delphacidae) is a planthopper species that feeds on rice plants (Oryza sativa L.). These insects are among the most important pests of rice, which is the major staple crop for about half the world's population.[1] They damage rice directly through feeding and also by transmitting two viruses, rice ragged stunt virus and rice grassy stunt virus. Up to 60% yield loss is common in susceptible rice cultivars attacked by the insect. The BPH is distributed in Australia, Bangladesh, Bhutan, Burma (Myanmar), Cambodia, China, Fiji, India,[2] Indonesia, Japan, North and South Korea, Laos, Malaysia, Nepal, Pakistan, Papua New Guinea, Philippines, Sri Lanka, Taiwan, Thailand, and Vietnam. Their alternative host plant other than rice is Leersia hexandra.",
        "image": "maize_orange_leafhopper.jpg"
    },
    {
        "name": "Brown planthopper",
        "desc": "The brown planthopper (BPH), Nilaparvata lugens (Stål) (Hemiptera: Delphacidae) is a planthopper species that feeds on rice plants (Oryza sativa L.). These insects are among the most important pests of rice, which is the major staple crop for about half the world's population.[1] They damage rice directly through feeding and also by transmitting two viruses, rice ragged stunt virus and rice grassy stunt virus. Up to 60% yield loss is common in susceptible rice cultivars attacked by the insect. The BPH is distributed in Australia, Bangladesh, Bhutan, Burma (Myanmar), Cambodia, China, Fiji, India,[2] Indonesia, Japan, North and South Korea, Laos, Malaysia, Nepal, Pakistan, Papua New Guinea, Philippines, Sri Lanka, Taiwan, Thailand, and Vietnam. Their alternative host plant other than rice is Leersia hexandra.",
        "image": "brown_planthopper.jpg"
    },
    {
        "name": "Whitebacked planthopper",
        "desc": "    Whitebacked planthopper  White Backed Plant Hopper : Sogatella furcifera  (Hovarth)(Hemiptera : Delphacidae) Kannada name : Bili Bennina Jigi Hulu  Vernacular name : Bili dhomi, Solle Adult: Tiny, straw coloured, wedge shaped insects with white stripe on their back. Found in two forms, Macropterous (long winged) and brachypterous(short winged)  Nymph: White to light yellow, with white band on its thorax . Eggs: Creamy white, elongate and curved (0.9 mm long and 0.2 mm wide). Period of occurrence:  Tillering to Panicle initiation stage. WBPH is active throughout the year in southern states. In northern regions activity in May in nursery and attains peak in August - September. Extent of yield loss: 11-39 %  (Khatri et al., 1983).Damaging stage of the insect: Nymphs and Adults Damage symptoms: Leaves turn yellow and later brownish. 'Hopper burn'. Sooty mould development due to honeydew secretion by hoppers. ",
        "image": "white_backed_planthopper.jpg"
    },
    {
        "name": "Smaller brown planthopper",
        "desc": "The planthopper feeds on its host by inserting its stylet into a leaf and sucking out the phloem sap. Excess fluid is excreted as honeydew and sooty mould grows on it. The plant's vigour is reduced through the loss of sap and the reduction in photosynthesis resulting from the sooty mould.[2] Brown patches appear on the leaves, which may also become discoloured. The leaves may wilt, later becoming desiccated and brown.[1] In India, P. perpusilla has at least 16 species of natural invertebrate enemies; some of these are parasitoids attacking the eggs and young nymphs, while others are predators and parasitoids of older nymphs and adults. The most successful parasitoid seems to be the moth Epiricania melanoleuca, and it is being used in biological pest control of P. perpusilla.",
        "image": "smaller_brown_planthopper.jpg"
    },
    {
        "name": "Black bugs",
        "desc": "    Black bugs  Black bugs remove the sap of the plant. They can cause browning of leaves, deadheart, and bugburn. Their damage also causes stunting in plants, reduced tiller number, and formation of whiteheads. On severe cases, black bugs weaken the plant preventing them from producing seeds. Why and where it occurs The insect is common in rainfed and irrigated wetland environments. It prefers continuously cropped irrigated rice areas and poorly drained fields. Damages are observed more frequently in dry season rice crops and densely planted fields. Black bug flight patterns are affected by the lunar cycle; on full moon nights, large numbers of adults swarm to light sources. Staggered planting of the rice crop and excessive nitrogen also favor the buildup of the pest. During non-rice periods, the presence of alternate breeding site favors population increase. ",
        "image": "black_bugs.jpg"
    },
    {
        "name": "Aphids",
        "desc": "    Aphids  are small sap-sucking insects and members of the superfamily Aphidoidea. Common names include greenfly and blackfly,[a] although individuals within a species can vary widely in colour. The group includes the fluffy white woolly aphids. A typical life cycle involves flightless females giving living birth to female nymphswithout the involvement of males. Maturing rapidly, females breed profusely so that the number of these insects multiplies quickly. Winged females may develop later in the season, allowing the insects to colonise new plants. In temperate regions, a phase of sexual reproduction occurs in the autumn, with the insects often overwintering as eggs. \n\nThe life cycle of some species involves an alternation between two species of host plants, for example between an annual crop and a woody plant. Some species feed on only one type of plant, while others are generalists, colonising many plant groups. About 5,000 species of aphid have been described, all included in the familyAphididae. Around 400 of these are found on food and fibre crops, and many are serious pests of agriculture and forestry, as well as an annoyance for gardeners. So-called dairying ants have a mutualistic relationship with aphids, tending them for theirhoneydew, and protecting them from predators. \n\nAphids are among the most destructive insect pests on cultivated plants in temperate regions. In addition to weakening the plant by sucking sap, they act as vectors forplant viruses and disfigure ornamental plants with deposits of honeydew and the subsequent growth of sooty moulds. Because of their ability to rapidly increase in numbers by asexual reproduction, they are a highly successful group of organisms from an ecological standpoint.\n\nControl of aphids is not easy. Insecticides do not always produce reliable results, given resistance to several classes of insecticide and the fact that aphids often feed on the undersides of leaves. On a garden scale, water jets and soap sprays are quite effective. Natural enemies include predatory ladybugs, hoverfly larvae,parasitic wasps, aphid midge larvae, crab spiders, lacewing larvae, andentomopathogenic fungi. An integrated pest management strategy using biological pest control can work, but is difficult to achieve except in enclosed environments such as glasshouses.",
        "image": "aphids.jpg"
    },
    {
        "name": "Mealybugs",
        "desc": "    Mealybugs  are insects in the family Pseudococcidae, unarmored scale insectsfound in moist, warm habitats. Many species are considered pests as they feed on plant juices of greenhouse plants, house plants and subtropical trees and also act as a vector for several plant diseases. Mealybugs are sexually dimorphic: females appear as nymphs, exhibiting reduced morphology, and lack wings, although unlike many female scale insects, they often retain legs and can move. Males are smaller, gnat-like and have wings. Since mealybugs (as well as all other Hemiptera) are hemimetabolous insects, they do not undergo complete metamorphosis in the true sense of the word. However, male mealybugs do exhibit a radical change during their life cycle, changing from wingless, ovoid nymphs to wasp-like flying adults. \n\nMealybug females feed on plant sap, normally in roots or other crevices, and in a few cases the bottoms of stored fruit. They attach themselves to the plant and secrete a powdery wax layer (hence the name 'mealy' bug) used for protection while they suck the plant juices. In Asia, mango mealybug is considered a major menace for the mango crop. The males on the other hand are short-lived as they do not feed at all as adults and only live to fertilize the females. Male citrus mealy bugs fly to the females and resemble fluffy gnats. \n\nSome species of mealybug lay their eggs in the same waxy layer used for protection in quantities of 50–100; other species are born directly from the female. \n\nThe most serious pests are mealybugs that feed on citrus; other species damagesugarcane, grapes, pineapple (Jahn et al. 2003), coffee trees, cassava, ferns, cacti,gardenias, papaya, mulberry, sunflower and orchids. Mealybugs only tend to be serious pests in the presence of ants because the ants protect them from predators and parasites.[2]Mealybugs also infest some species of carnivorous plant such as Sarracenia (pitcher plants); in such cases it is difficult to eradicate them without repeated applications ofinsecticide such as diazinon. Small infestations may not inflict significant damage. In larger amounts though, they can induce leaf drop. In recent years, some of the mealybug species have become invasive pest in localities posing a great problem to the new agro-ecosystems. In India, Withania somnifera plant have been reported as a new reservoir host for an invasive mealybug species Phenacoccus solenopsis.\n\nFossil specimens of genus Acropyga ants have been recovered from the Burdigalian stageDominican amber deposits and several individuals are preserved carrying the extinct mealybug genus Electromyrmococcus. These fossils represent the oldest record of thesymbiosis between mealybugs and Acropyga species ants. ",
        "image": "mealybugs.jpg"
    }
]